app/views/meals/_ingredient_fields.html.erb

      <%= f.label :item_id %><br>
      <%= f.select :item_id, Item.all.collect { |p| [ p.name, p.id ] }, include_blank: true %><br>
---
SELECT "items".* FROM "items"