app/views/meals/show.html.erb

SELECT  "items".* FROM "items" INNER JOIN "ingredients" ON "items"."id" = "ingredients"."item_id" WHERE "ingredients"."meal_id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["meal_id", 18]]
---
<h2>Items</h2>
<% @meal.items.each do |item| %>

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."meal_id" = ? AND "ingredients"."id" = ? LIMIT 1  [["meal_id", 19], ["id", 1]]
---
  <dt>Quantity:</dt>
  <dd><%= item.ingredients.find_by(meal: @meal).quantity %> <%= item.measurment_unit %></dd>