app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "cost", "measurment_unit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Labn"], ["cost", 7.0], ["measurment_unit", "kilo"], ["created_at", "2015-09-03 16:41:05.669223"], ["updated_at", "2015-09-03 16:41:05.669223"]]