app/controllers/meals_controller.rb

SELECT `meals`.* FROM `meals`
---
  def index
    @meals = Meal.all

INSERT INTO "meals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fataa"], ["created_at", "2015-09-03 15:03:31.990005"], ["updated_at", "2015-09-03 15:03:31.990005"]]
---
  def create
    @meal = Meal.new(meal_params)
    respond_to do |format|
      if @meal.save

UPDATE "meals" SET "price" = ?, "name" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["price", 10.2], ["name", "ahmed"], ["updated_at", "2015-09-22 14:11:05.415539"], ["id", 19]]
---
  def update
    respond_to do |format|
      if @meal.update(meal_params)

DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 4]]
---
  def destroy
    @meal.destroy

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_meal
      @meal = Meal.find(params[:id])