app/controllers/transactions_controller.rb

SELECT "food_transactions".* FROM "food_transactions"
SELECT "item_transactions".* FROM "item_transactions"
---
  def new
    @transaction = Transaction.new
    @food_transactions = FoodTransaction.all

INSERT INTO "transactions" ("name", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Friday list"], ["notes", ""], ["created_at", "2015-09-22 23:01:52.526834"], ["updated_at", "2015-09-22 23:01:52.526834"]]
---
  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", 1]]
SELECT "food_transactions".* FROM "food_transactions" WHERE "food_transactions"."transaction_id" = ?  [["transaction_id", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])