app/views/transactions/_food_transaction_fields.html.erb

SELECT "meals".* FROM "meals"
---
      <%= f.label :meal_id %><br>
      <%= f.select :meal_id, Meal.all.collect { |p| [ p.name, p.id ] }, include_blank: true %><br>